---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.IndexPoint.#ctor(System.Int32)
source: html/40674d79-2d0c-e118-b7b1-ece7de4aa079.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexPoint.#ctor Method

Constructs the point primitive.

## Syntax (C#)
```csharp
public IndexPoint(
	int index
)
```

## Parameters
- **index** (`System.Int32`) - The index of the point's vertex.